src/main/java/registersoap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://Interface.ssns.swt.cug/">
   <soapenv:Header/>
   <soapenv:Body>
      <int:register>
         <!--Optional:-->
         <sensorid>?</sensorid>
         <!--Optional:-->
         <sosAdress>?</sosAdress>
         <!--Optional:-->
         <frequence>?</frequence>
      </int:register>
   </soapenv:Body>
</soapenv:Envelope>